<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html template="true"><head><meta content="text/html; charset=ISO-8859-1" http-equiv="content-type"><title>alg</title></head><body><h1><span style="font-weight: bold;">&#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1086;&#1084;</span></h1><span style="font-weight: bold;"><br></span>&#1050;&#1085;&#1086;&#1087;&#1082;<span style="font-weight: bold;">&#1072; <span style="font-weight: bold;">&#1055;&#1091;&#1089;&#1082; </span></span>&#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;. &#1042;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072; &#1089; &#1075;&#1088;&#1072;&#1092;&#1086;&#1084; &#1073;&#1091;&#1076;&#1091;&#1090; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090;&#1100;<br>&#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1080;&#1076;&#1085;&#1086; &#1085;&#1072; &#1074;&#1080;&#1076;&#1078;&#1077;&#1090;&#1077; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1075;&#1088;&#1072;&#1092;&#1072; &#1080; &#1074; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1077; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1086;&#1074;.<br>&#1047;&#1072;&#1082;&#1086;&#1085;&#1095;&#1080;&#1090;&#1089;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077;&#1084;<br>"&#1050;&#1086;&#1085;&#1077;&#1094;".<br><br>&#1050;&#1085;&#1086;&#1087;&#1082;&#1072; <span style="font-weight: bold;">&#1057;&#1073;&#1088;&#1086;&#1089; </span>&#1089;&#1073;&#1088;&#1072;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090; &#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1080; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1099; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072;<br><br>&#1055;&#1086;&#1083;&#1079;&#1091;&#1085;&#1086;&#1082; <span style="font-weight: bold;">&#1057;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1100;</span> &#1087;&#1088;&#1080; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1080; &#1074;&#1087;&#1088;&#1072;&#1074;&#1086; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090; &#1074;&#1088;&#1077;&#1084;&#1103; &#1084;&#1077;&#1078;&#1076;&#1091; &#1080;&#1090;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103;&#1084;&#1080; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072;<br><br>&#1060;&#1083;&#1072;&#1078;&#1086;&#1082; <span style="font-weight: bold;">&#1055;&#1086;&#1096;&#1072;&#1075;&#1086;&#1074;&#1086;</span> &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1076;&#1080;&#1085; &#1096;&#1072;&#1075; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072; &#1087;&#1086; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1102; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; "&#1055;&#1091;&#1089;&#1082;"<br><br>&#1060;&#1083;&#1072;&#1078;&#1086;&#1082; <span style="font-weight: bold;">"&#1052;&#1077;&#1090;&#1082;&#1080; &#1087;&#1086; &#1080;&#1090;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103;&#1084;" </span>&#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;: &#1074;&#1077;&#1088;&#1096;&#1080;&#1085;&#1099; &#1082;&#1088;&#1072;&#1089;&#1103;&#1090;&#1089;&#1103; &#1086;&#1090; &#1082;&#1088;&#1072;&#1089;&#1085;&#1086;&#1075;&#1086;<br>&#1082; &#1092;&#1080;&#1086;&#1083;&#1077;&#1090;&#1086;&#1074;&#1086;&#1084;&#1091;. &#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;, &#1090;&#1086; &#1095;&#1077;&#1084; &#1076;&#1072;&#1083;&#1100;&#1096;&#1077; &#1094;&#1074;&#1077;&#1090; &#1086;&#1090; &#1082;&#1088;&#1072;&#1089;&#1085;&#1086;&#1075;&#1086;, &#1090;&#1077;&#1084; &#1073;&#1083;&#1080;&#1078;&#1077; &#1082; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1081;<br>&#1080;&#1090;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1088;&#1077;&#1073;&#1088;&#1086; &#1087;&#1077;&#1088;&#1077;&#1082;&#1088;&#1072;&#1096;&#1077;&#1085;&#1086;. &#1048;&#1085;&#1072;&#1095;&#1077; - &#1073;&#1086;&#1083;&#1077;&#1077; &#1076;&#1072;&#1083;&#1077;&#1082;&#1086; &#1086;&#1090; &#1082;&#1088;&#1072;&#1089;&#1085;&#1086;&#1075;&#1086; &#1088;&#1077;&#1073;&#1088;&#1086;, &#1087;&#1077;&#1088;&#1077;&#1082;&#1088;&#1072;&#1096;&#1077;&#1085;&#1085;&#1086;&#1077; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1084;,<br>&#1074;&#1093;&#1086;&#1076;&#1103;&#1097;&#1080;&#1084; &#1074; &#1074;&#1077;&#1088;&#1096;&#1080;&#1085;&#1091;.</body></html>